7767517
314 401
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=32 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 9=2
Convolution              convrelu_1               1 1 1 2 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432 9=2
Split                    splitncnn_0              1 2 2 3 4
Convolution              convrelu_2               1 1 4 5 0=32 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=2
Convolution              convrelu_3               1 1 5 6 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=2
BinaryOp                 add_0                    2 1 3 6 7 0=0
Convolution              convrelu_4               1 1 7 8 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728 9=2
Split                    splitncnn_1              1 2 8 9 10
Convolution              convrelu_5               1 1 10 11 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=2
Convolution              convrelu_6               1 1 11 12 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=2
BinaryOp                 add_1                    2 1 9 12 13 0=0
Split                    splitncnn_2              1 2 13 14 15
Convolution              convrelu_7               1 1 15 16 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=2
Convolution              convrelu_8               1 1 16 17 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=2
BinaryOp                 add_2                    2 1 14 17 18 0=0
Convolution              convrelu_9               1 1 18 19 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912 9=2
Split                    splitncnn_3              1 2 19 20 21
Convolution              convrelu_10              1 1 21 22 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
Convolution              convrelu_11              1 1 22 23 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=2
BinaryOp                 add_3                    2 1 20 23 24 0=0
Split                    splitncnn_4              1 2 24 25 26
Convolution              convrelu_12              1 1 26 27 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
Convolution              convrelu_13              1 1 27 28 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=2
BinaryOp                 add_4                    2 1 25 28 29 0=0
Split                    splitncnn_5              1 2 29 30 31
Convolution              convrelu_14              1 1 31 32 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
Convolution              convrelu_15              1 1 32 33 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=2
BinaryOp                 add_5                    2 1 30 33 34 0=0
Split                    splitncnn_6              1 2 34 35 36
Convolution              convrelu_16              1 1 36 37 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
Convolution              convrelu_17              1 1 37 38 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=2
BinaryOp                 add_6                    2 1 35 38 39 0=0
Split                    splitncnn_7              1 2 39 40 41
Convolution              convrelu_18              1 1 41 42 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
Convolution              convrelu_19              1 1 42 43 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=2
BinaryOp                 add_7                    2 1 40 43 44 0=0
Split                    splitncnn_8              1 2 44 45 46
Convolution              convrelu_20              1 1 46 47 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
Convolution              convrelu_21              1 1 47 48 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=2
BinaryOp                 add_8                    2 1 45 48 49 0=0
Split                    splitncnn_9              1 2 49 50 51
Convolution              convrelu_22              1 1 51 52 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
Convolution              convrelu_23              1 1 52 53 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=2
BinaryOp                 add_9                    2 1 50 53 54 0=0
Split                    splitncnn_10             1 2 54 55 56
Convolution              convrelu_24              1 1 56 57 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
Convolution              convrelu_25              1 1 57 58 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=2
BinaryOp                 add_10                   2 1 55 58 59 0=0
Split                    splitncnn_11             1 2 59 60 61
Convolution              convrelu_26              1 1 61 62 0=512 1=3 -23310=1,1.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1179648 9=2
Split                    splitncnn_12             1 2 62 63 64
Convolution              convrelu_27              1 1 64 65 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=2
Convolution              convrelu_28              1 1 65 66 0=512 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=2
BinaryOp                 add_11                   2 1 63 66 67 0=0
Split                    splitncnn_13             1 2 67 68 69
Convolution              convrelu_29              1 1 69 70 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=2
Convolution              convrelu_30              1 1 70 71 0=512 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=2
BinaryOp                 add_12                   2 1 68 71 72 0=0
Split                    splitncnn_14             1 2 72 73 74
Convolution              convrelu_31              1 1 74 75 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=2
Convolution              convrelu_32              1 1 75 76 0=512 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=2
BinaryOp                 add_13                   2 1 73 76 77 0=0
Split                    splitncnn_15             1 2 77 78 79
Convolution              convrelu_33              1 1 79 80 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=2
Convolution              convrelu_34              1 1 80 81 0=512 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=2
BinaryOp                 add_14                   2 1 78 81 82 0=0
Split                    splitncnn_16             1 2 82 83 84
Convolution              convrelu_35              1 1 84 85 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=2
Convolution              convrelu_36              1 1 85 86 0=512 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=2
BinaryOp                 add_15                   2 1 83 86 87 0=0
Split                    splitncnn_17             1 2 87 88 89
Convolution              convrelu_37              1 1 89 90 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=2
Convolution              convrelu_38              1 1 90 91 0=512 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=2
BinaryOp                 add_16                   2 1 88 91 92 0=0
Split                    splitncnn_18             1 2 92 93 94
Convolution              convrelu_39              1 1 94 95 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=2
Convolution              convrelu_40              1 1 95 96 0=512 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=2
BinaryOp                 add_17                   2 1 93 96 97 0=0
Split                    splitncnn_19             1 2 97 98 99
Convolution              convrelu_41              1 1 99 100 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=2
Convolution              convrelu_42              1 1 100 101 0=512 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=2
BinaryOp                 add_18                   2 1 98 101 102 0=0
Split                    splitncnn_20             1 2 102 103 104
Convolution              convrelu_43              1 1 104 105 0=1024 1=3 -23310=1,1.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4718592 9=2
Split                    splitncnn_21             1 2 105 106 107
Convolution              convrelu_44              1 1 107 108 0=512 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=2
Convolution              convrelu_45              1 1 108 109 0=1024 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4718592 9=2
BinaryOp                 add_19                   2 1 106 109 110 0=0
Split                    splitncnn_22             1 2 110 111 112
Convolution              convrelu_46              1 1 112 113 0=512 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=2
Convolution              convrelu_47              1 1 113 114 0=1024 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4718592 9=2
BinaryOp                 add_20                   2 1 111 114 115 0=0
Split                    splitncnn_23             1 2 115 116 117
Convolution              convrelu_48              1 1 117 118 0=512 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=2
Convolution              convrelu_49              1 1 118 119 0=1024 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4718592 9=2
BinaryOp                 add_21                   2 1 116 119 120 0=0
Split                    splitncnn_24             1 2 120 121 122
Convolution              convrelu_50              1 1 122 123 0=512 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=2
Convolution              convrelu_51              1 1 123 124 0=1024 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4718592 9=2
BinaryOp                 add_22                   2 1 121 124 125 0=0
Convolution              convrelu_52              1 1 125 126 0=512 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=2
Split                    splitncnn_25             1 4 126 127 128 129 130
Pooling                  maxpool2d_176            1 1 128 131 0=0 1=13 11=13 12=1 13=6 2=1 3=6 5=1
Pooling                  maxpool2d_175            1 1 129 132 0=0 1=9 11=9 12=1 13=4 2=1 3=4 5=1
Pooling                  maxpool2d_174            1 1 130 133 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_0                    4 1 127 133 132 131 134 0=0
Convolution              conv_70                  1 1 134 135 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1048576
pnnx.Expression          pnnx_expr_1400           0 1 136
Split                    splitncnn_26             1 3 136 137 138 139
pnnx.Expression          pnnx_expr_1399           0 1 140
Split                    splitncnn_27             1 6 140 141 142 143 144 145 146
pnnx.Expression          pnnx_expr_1394           0 1 147
Split                    splitncnn_28             1 3 147 148 149 150
pnnx.Expression          pnnx_expr_1381           0 1 151
aten::rand               pnnx_73                  5 1 151 148 141 142 137 152
torch.lt                 torch.lt_374             1 1 152 153
ExpandDims               unsqueeze_219            1 1 153 154 -23303=1,0
Pooling                  maxpool2d_3              1 1 154 155 0=0 1=3 11=3 12=1 13=1 2=1 3=1 5=1
Squeeze                  squeeze_213              1 1 155 156 -23303=1,0
BinaryOp                 sub_23                   1 1 156 157 0=7 1=1 2=1.000000e+00
MemoryData               pnnx_fold_585            0 1 158 0=25 1=25 2=1
Convolution              convrelu_53              1 1 135 159 0=1024 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4718592 9=2
Convolution              convrelu_54              1 1 159 160 0=512 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=2
BinaryOp                 mul_24                   2 1 160 158 161 0=2
BinaryOp                 mul_25                   1 1 161 162 0=2 1=1 2=6.250000e+02
Reduction                sum_216                  1 1 157 163 0=0 1=1 4=0
BinaryOp                 div_26                   2 1 162 163 164 0=3
Convolution              convrelu_55              1 1 164 165 0=1024 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4718592 9=2
Convolution              convrelu_56              1 1 165 166 0=512 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=2
Split                    splitncnn_29             1 3 166 167 168 169
Convolution              convrelu_57              1 1 169 170 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=2
Interp                   upsample_nearest_15      1 1 170 171 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_1                    2 1 171 103 172 0=0
pnnx.Expression          pnnx_expr_1300           0 1 173
aten::rand               pnnx_173                 5 1 173 149 143 144 138 174
torch.lt                 torch.lt_375             1 1 174 175
ExpandDims               unsqueeze_220            1 1 175 176 -23303=1,0
Pooling                  maxpool2d_4              1 1 176 177 0=0 1=3 11=3 12=1 13=1 2=1 3=1 5=1
Squeeze                  squeeze_214              1 1 177 178 -23303=1,0
BinaryOp                 sub_27                   1 1 178 179 0=7 1=1 2=1.000000e+00
MemoryData               pnnx_fold_679            0 1 180 0=50 1=50 2=1
Convolution              convrelu_58              1 1 172 181 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608 9=2
Convolution              convrelu_59              1 1 181 182 0=512 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=2
Convolution              convrelu_60              1 1 182 183 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=2
BinaryOp                 mul_28                   2 1 183 180 184 0=2
BinaryOp                 mul_29                   1 1 184 185 0=2 1=1 2=2.500000e+03
Reduction                sum_217                  1 1 179 186 0=0 1=1 4=0
BinaryOp                 div_30                   2 1 185 186 187 0=3
Convolution              convrelu_61              1 1 187 188 0=512 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=2
Convolution              convrelu_62              1 1 188 189 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=2
Split                    splitncnn_30             1 3 189 190 191 192
Convolution              convrelu_63              1 1 192 193 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
Interp                   upsample_nearest_16      1 1 193 194 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_2                    2 1 194 60 195 0=0
pnnx.Expression          pnnx_expr_1219           0 1 196
aten::rand               pnnx_273                 5 1 196 150 145 146 139 197
torch.lt                 torch.lt_376             1 1 197 198
ExpandDims               unsqueeze_221            1 1 198 199 -23303=1,0
Pooling                  maxpool2d_5              1 1 199 200 0=0 1=3 11=3 12=1 13=1 2=1 3=1 5=1
Squeeze                  squeeze_215              1 1 200 201 -23303=1,0
BinaryOp                 sub_31                   1 1 201 202 0=7 1=1 2=1.000000e+00
MemoryData               pnnx_fold_773            0 1 203 0=100 1=100 2=1
Convolution              convrelu_64              1 1 195 204 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152 9=2
Convolution              convrelu_65              1 1 204 205 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=2
Convolution              convrelu_66              1 1 205 206 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
BinaryOp                 mul_32                   2 1 206 203 207 0=2
BinaryOp                 mul_33                   1 1 207 208 0=2 1=1 2=1.000000e+04
Reduction                sum_218                  1 1 202 209 0=0 1=1 4=0
BinaryOp                 div_34                   2 1 208 209 210 0=3
Convolution              convrelu_67              1 1 210 211 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=2
Convolution              convrelu_68              1 1 211 212 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
Split                    splitncnn_31             1 2 212 213 214
Convolution              convrelu_69              1 1 213 215 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=2
Convolution              conv_98                  1 1 215 216 0=15 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840
Convolution              convrelu_70              1 1 214 217 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=2
Convolution              conv_96                  1 1 217 218 0=10 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2560
Concat                   cat_3                    2 1 218 216 219 0=0
Convolution              convrelu_71              1 1 190 220 0=512 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=2
Convolution              conv_94                  1 1 220 221 0=15 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680
Convolution              convrelu_72              1 1 191 222 0=512 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=2
Convolution              conv_92                  1 1 222 223 0=10 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=5120
Concat                   cat_4                    2 1 223 221 224 0=0
Convolution              convrelu_73              1 1 167 225 0=1024 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4718592 9=2
Convolution              conv_90                  1 1 225 226 0=15 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360
Convolution              convrelu_74              1 1 168 227 0=1024 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4718592 9=2
Convolution              conv_88                  1 1 227 228 0=10 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=10240
Concat                   cat_5                    2 1 228 226 229 0=0
Permute                  permute_210              1 1 219 230 0=3
Split                    splitncnn_32             1 2 230 out0 232
Split                    splitncnn_33             1 5 232 233 234 235 236 237
Crop                     slice_177                1 1 237 238 -23310=1,4 -23311=1,2 -23309=1,0
aten::exp                pnnx_540                 1 1 238 239
BinaryOp                 mul_35                   1 1 239 240 0=2 1=1 2=8.000000e+00
Split                    splitncnn_34             1 5 240 241 242 243 244 245
MemoryData               pnnx_fold_938            0 1 246 0=1 1=100 2=100
Split                    splitncnn_35             1 2 246 247 248
MemoryData               pnnx_fold_950            0 1 249 0=1 1=100 2=100
Split                    splitncnn_36             1 2 249 250 251
Crop                     slice_179                1 1 244 252 -23310=1,4 -23311=1,2 -23309=1,3
Split                    splitncnn_37             1 2 252 253 254
Crop                     slice_178                1 1 245 255 -23310=1,2 -23311=1,2 -23309=1,1
Split                    splitncnn_38             1 2 255 256 257
BinaryOp                 add_36                   2 1 256 253 258 0=0
Crop                     slice_181                1 1 242 259 -23310=1,3 -23311=1,2 -23309=1,2
Split                    splitncnn_39             1 2 259 260 261
Crop                     slice_180                1 1 243 262 -23310=1,1 -23311=1,2 -23309=1,0
Split                    splitncnn_40             1 2 262 263 264
BinaryOp                 add_37                   2 1 263 260 265 0=0
BinaryOp                 sub_38                   2 1 247 254 266 0=1
BinaryOp                 add_39                   2 1 248 257 267 0=0
BinaryOp                 add_40                   2 1 267 266 268 0=0
BinaryOp                 div_41                   1 1 268 269 0=3 1=1 2=2.000000e+00
BinaryOp                 sub_42                   2 1 250 264 270 0=1
BinaryOp                 add_43                   2 1 251 261 271 0=0
BinaryOp                 add_44                   2 1 271 270 272 0=0
BinaryOp                 div_45                   1 1 272 273 0=3 1=1 2=2.000000e+00
Crop                     slice_182                1 1 236 274 -23310=1,8 -23311=1,2 -23309=1,4
Sigmoid                  sigmoid_6                1 1 274 275
Clip                     clamp_204                1 1 275 276 0=1.000000e-02 1=1.000000e+00
BinaryOp                 sub_46                   1 1 276 277 0=1 1=1 2=1.000000e-02
BinaryOp                 div_47                   1 1 277 278 0=3 1=1 2=9.900000e-01
Concat                   cat_6                    4 1 269 273 258 265 279 0=2
Crop                     slice_183                1 1 235 280 -23310=1,9 -23311=1,2 -23309=1,8
HardSigmoid              hsigmoid_0               1 1 280 281 0=1.666667e-01 1=5.000000e-01
Crop                     slice_185                1 1 233 282 -23310=1,10 -23311=1,2 -23309=1,9
Sigmoid                  sigmoid_8                1 1 282 283
Crop                     slice_184                1 1 234 284 -23310=1,-233 -23311=1,2 -23309=1,10
Sigmoid                  sigmoid_7                1 1 284 285
Concat                   cat_7                    6 1 279 278 281 241 283 285 out3 0=2
Permute                  permute_211              1 1 224 287 0=3
Split                    splitncnn_41             1 2 287 out1 289
Split                    splitncnn_42             1 5 289 290 291 292 293 294
Crop                     slice_186                1 1 294 295 -23310=1,4 -23311=1,2 -23309=1,0
aten::exp                pnnx_1221                1 1 295 296
BinaryOp                 mul_48                   1 1 296 297 0=2 1=1 2=1.600000e+01
Split                    splitncnn_43             1 5 297 298 299 300 301 302
MemoryData               pnnx_fold_1147           0 1 303 0=1 1=50 2=50
Split                    splitncnn_44             1 2 303 304 305
MemoryData               pnnx_fold_1159           0 1 306 0=1 1=50 2=50
Split                    splitncnn_45             1 2 306 307 308
Crop                     slice_188                1 1 301 309 -23310=1,4 -23311=1,2 -23309=1,3
Split                    splitncnn_46             1 2 309 310 311
Crop                     slice_187                1 1 302 312 -23310=1,2 -23311=1,2 -23309=1,1
Split                    splitncnn_47             1 2 312 313 314
BinaryOp                 add_49                   2 1 313 310 315 0=0
Crop                     slice_190                1 1 299 316 -23310=1,3 -23311=1,2 -23309=1,2
Split                    splitncnn_48             1 2 316 317 318
Crop                     slice_189                1 1 300 319 -23310=1,1 -23311=1,2 -23309=1,0
Split                    splitncnn_49             1 2 319 320 321
BinaryOp                 add_50                   2 1 320 317 322 0=0
BinaryOp                 sub_51                   2 1 304 311 323 0=1
BinaryOp                 add_52                   2 1 305 314 324 0=0
BinaryOp                 add_53                   2 1 324 323 325 0=0
BinaryOp                 div_54                   1 1 325 326 0=3 1=1 2=2.000000e+00
BinaryOp                 sub_55                   2 1 307 321 327 0=1
BinaryOp                 add_56                   2 1 308 318 328 0=0
BinaryOp                 add_57                   2 1 328 327 329 0=0
BinaryOp                 div_58                   1 1 329 330 0=3 1=1 2=2.000000e+00
Crop                     slice_191                1 1 293 331 -23310=1,8 -23311=1,2 -23309=1,4
Sigmoid                  sigmoid_9                1 1 331 332
Clip                     clamp_205                1 1 332 333 0=1.000000e-02 1=1.000000e+00
BinaryOp                 sub_59                   1 1 333 334 0=1 1=1 2=1.000000e-02
BinaryOp                 div_60                   1 1 334 335 0=3 1=1 2=9.900000e-01
Concat                   cat_8                    4 1 326 330 315 322 336 0=2
Crop                     slice_192                1 1 292 337 -23310=1,9 -23311=1,2 -23309=1,8
HardSigmoid              hsigmoid_1               1 1 337 338 0=1.666667e-01 1=5.000000e-01
Crop                     slice_194                1 1 290 339 -23310=1,10 -23311=1,2 -23309=1,9
Sigmoid                  sigmoid_11               1 1 339 340
Crop                     slice_193                1 1 291 341 -23310=1,-233 -23311=1,2 -23309=1,10
Sigmoid                  sigmoid_10               1 1 341 342
Concat                   cat_9                    6 1 336 335 338 298 340 342 out4 0=2
Permute                  permute_212              1 1 229 344 0=3
Split                    splitncnn_50             1 2 344 out2 346
Split                    splitncnn_51             1 5 346 347 348 349 350 351
Crop                     slice_195                1 1 351 352 -23310=1,4 -23311=1,2 -23309=1,0
aten::exp                pnnx_1902                1 1 352 353
BinaryOp                 mul_61                   1 1 353 354 0=2 1=1 2=3.200000e+01
Split                    splitncnn_52             1 5 354 355 356 357 358 359
MemoryData               pnnx_fold_1356           0 1 360 0=1 1=25 2=25
Split                    splitncnn_53             1 2 360 361 362
MemoryData               pnnx_fold_1368           0 1 363 0=1 1=25 2=25
Split                    splitncnn_54             1 2 363 364 365
Crop                     slice_197                1 1 358 366 -23310=1,4 -23311=1,2 -23309=1,3
Split                    splitncnn_55             1 2 366 367 368
Crop                     slice_196                1 1 359 369 -23310=1,2 -23311=1,2 -23309=1,1
Split                    splitncnn_56             1 2 369 370 371
BinaryOp                 add_62                   2 1 370 367 372 0=0
Crop                     slice_199                1 1 356 373 -23310=1,3 -23311=1,2 -23309=1,2
Split                    splitncnn_57             1 2 373 374 375
Crop                     slice_198                1 1 357 376 -23310=1,1 -23311=1,2 -23309=1,0
Split                    splitncnn_58             1 2 376 377 378
BinaryOp                 add_63                   2 1 377 374 379 0=0
BinaryOp                 sub_64                   2 1 361 368 380 0=1
BinaryOp                 add_65                   2 1 362 371 381 0=0
BinaryOp                 add_66                   2 1 381 380 382 0=0
BinaryOp                 div_67                   1 1 382 383 0=3 1=1 2=2.000000e+00
BinaryOp                 sub_68                   2 1 364 378 384 0=1
BinaryOp                 add_69                   2 1 365 375 385 0=0
BinaryOp                 add_70                   2 1 385 384 386 0=0
BinaryOp                 div_71                   1 1 386 387 0=3 1=1 2=2.000000e+00
Crop                     slice_200                1 1 350 388 -23310=1,8 -23311=1,2 -23309=1,4
Sigmoid                  sigmoid_12               1 1 388 389
Clip                     clamp_206                1 1 389 390 0=1.000000e-02 1=1.000000e+00
BinaryOp                 sub_72                   1 1 390 391 0=1 1=1 2=1.000000e-02
BinaryOp                 div_73                   1 1 391 392 0=3 1=1 2=9.900000e-01
Concat                   cat_10                   4 1 383 387 372 379 393 0=2
Crop                     slice_201                1 1 349 394 -23310=1,9 -23311=1,2 -23309=1,8
HardSigmoid              hsigmoid_2               1 1 394 395 0=1.666667e-01 1=5.000000e-01
Crop                     slice_203                1 1 347 396 -23310=1,10 -23311=1,2 -23309=1,9
Sigmoid                  sigmoid_14               1 1 396 397
Crop                     slice_202                1 1 348 398 -23310=1,-233 -23311=1,2 -23309=1,10
Sigmoid                  sigmoid_13               1 1 398 399
Concat                   cat_11                   6 1 393 392 395 355 397 399 out5 0=2
